app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`) VALUES('edsonpaul', '-6177273180.933420190864808', '2010-05-13 12:32:49', '2010-05-13 12:32:49', 'fcc7f1c961944a24de432c8949060e120666574d')